package intel;

public class Modifiers {
/*
Modifiers => 수정자
- public : 액세스 수정자 [클래스,속성,매서드 및 생성자에 대한 엑세스 수준을 설정하는데 사용됩니다]
액세스 수정자 => 액세스 수준을 제어합니다
비액세스 수정자 => 액세스 수준을 제어하지 않지만 다른 기능을 제공합니다

접근 수정자
클래스의 경우
public [모든클래스에서 사용]or default[동일한 패키지 내의 클래스에서만 접근할수 있습니다]를 사용할수 있다
private : 선언된 클래스내에서만 엑세스 할수 있습니다
protected : 동일한 패키지와 하위 클래스에서 엑세스 할수 있습니다

비접근 수정자
final : 속성 및 매서드는 재정의 수정할수 없습니다
static : 속성과 매서드는 객체가 아닌 클래스에 속합니다
abstract : 추상클래스에서만 사용할수 있으며 매서드에서만 사용할수 있다 본문이 없음
synchronized : 메서드는 한번에 하나의 스레드에서만 엑새스를 할수 있다
volatile : 속성값은 스레드 로컬로 캐시[데이터를 빠르게 접근할수 있도록 저장해 놓은 임시저장소]되지 않으며 항상 메인 메모리에서 읽은다
transient : 속성과 매서드는 이를 포함하는 객체를 직렬화 할때 건너뜁니다
*/
}
